"""
练习
"""

# 字典定义时，只关心逗号
dict1 = {
    '王': {
        '部门': '科技部',
        '工资': 3000,
        '级别': 1
    },
    '周': {
        '部门': '市场部',
        '工资': 5000,
        '级别': 2
    },
    '林': {
        '部门': '市场部',
        '工资': 7000,
        '级别': 3
    },
    '张': {
        '部门': '科技部',
        '工资': 4000,
        '级别': 1
    },
    '刘': {
        '部门': '市场部',
        '工资': 6000,
        '级别': 2
    }
}
print(dict1)

for key in dict1:
    if dict1[key]['级别'] == 1:
        # print(type(dict1[key]['级别']))
        # print(type(dict1[key]['工资']))
        dict1[key]['级别'] += 1
        dict1[key]['工资'] += 1000
print(dict1)



